In [4]:
import pandas as pd
import numpy as np
import re

pd.options.display.max_columns = None

### `Question-1:`

The dataset is based on NFTs. This is quite large. So, when you will read the dataset, you have to wait. The link of the dataset: https://tinyurl.com/2pfhncqw

Your task is to make a pivote table by using the columns "verification_status", "contract_type", "rarity_score" and "last_sale_price" to find out the total values.

In [ ]:
# code here

### `Question-2:`

You are given a dataset about the cars' price and miles driven of different cars throughout the different years. The link of the dataset: https://tinyurl.com/2r24n45l. Your tasks are
- make a pivot table of the brands (the required brands are given below) from the "Year" 2018 to the year 2022 in which the "Price" is shown as average values and "Miles" are in median values. In this pivote table, every row represents a particular brand and each column represents either average "Price" of a partucular year or median values of "Miles" of a particular year.
- At the end plot a kde chart for the "Price" and "Miles" by using your pivot table.

There are some challenges to solve this task:
- There is no column that is represented to the brand name of the car. You have to find out on your own.
- Some values of "Years" column are misleading. You have to reset this column too that every value should tell a valid meaning.

In [59]:
# code here
link = "https://tinyurl.com/2r24n45l"
car_df = pd.read_csv(link)

In [65]:
def fun(model):
    return model.split(" ")[0]
car_df['BrandName'] = car_df['Name'].apply(fun)

In [71]:
car_df.Year.unique()

array([    2018,     2020,     2012,     2019,    20173,     2016,
           2017,     2015,     2014,     2010,    20194,    20165,
           2013,    20133,     2011,  2013500,  2017124,     2021,
           2022,   201650,    20163,    20215,    20113,    20152,
       20141500,   202130,    20204,    20153,  2014500,  2016500,
          20103,    20156,  2017500,   201040,  2013300,  2015200,
        2013150,    20125,    20185,    20166,    20146,    20213,
         202180,   201860,    20184,    20203,    20143,    20144,
         201550,   202050,   202150,    20199,    20219,    20205,
         201730,   202060,  2018500,  2015500,  2010370,   201750,
          20174,   201360,   200970,    20193,    20145,    20164,
          20123,    20176,  2016200,   201560,  2015900,    20161,
        2016900,    20154,    20182,    20157,  2019500,    20183,
          20122,    20129,    20114,  2020150, 20211500,    20135,
          20196,  2014200, 20201500,    20195,    20134,    20169,
         201850,  2021300,    20095,  2016300,  2013200,    20105,
         201460,     2009,    20136,    20151,  2020300,    20115,
          20214,   201660,    20209,    20175,   201980,    20172,
        2012300,  2018300,   201450, 20151500,   201540,   201960,
          20202,   202286,    20186,   201760,    20155,    20112,
          20212,    20225,    20232,    20206,    20111, 20171500,
         202140,  2019124,   202260,    20181,   201940,    20222,
        2018150,  2013911,  2021150,    20224, 20161500,    20223,
       20191500,  2016370,   201950,   202230, 20222500, 20223500,
       20181500,  2014370, 20221500,   201570,   201890,   201880,
          20162,  2017718,    20124,  2017150,  2017370,   201790,
         202090,  2022150,   201990,    20226,    20201,   201930,
          20216, 20152500,    20147,   201970,   201886,  2016150,
        2018718,    20191,    20189,  2015300,   201690,   202270,
         202160,    20187,     2023,    20149,   201270,    20211,
        2019150,   202030,    20192,   201780,    20171,  2018124,
        2019300,    20128,    20093,   201830,    20096,   201260,
        2012200,  2012500,  2017200,    20127,    20101,    20126,
         201770,  2017300,    20094,  2011200, 20131500,  2014300,
          20141,    20131,    20104,    20139,    20132,  2011370,
          20142], dtype=int64)

In [14]:
car_df=car_df[(car_df['Year']>=2018) & (car_df['Year']<=2022)]
pd.pivot_table(car_df,index=['Name'],columns=['Year'],aggfunc={'Price':'mean','Miles':'median'},values=['Price','Miles'])

                                      Miles                             \
Year                                   2018     2019     2020     2021
Name
Acura ILX                           32516.0      NaN      NaN      NaN
Acura MDX                           86981.0  50959.0      NaN      NaN
Acura MDX Sport Hybrid                  NaN  32675.0      NaN      NaN
Acura RDX                               NaN  26612.0  30894.0  10922.0
Alfa Romeo Giulia                   22441.0  20928.0      NaN      NaN
...                                     ...      ...      ...      ...
Volkswagen Passat                   48021.0  47135.0  32237.0  28162.0
Volkswagen Tiguan                   48034.0  53383.0  45395.0  44425.0
Volkswagen Tiguan Limited           48794.0      NaN      NaN      NaN
smart fortwo electric drive         20157.5      NaN      NaN      NaN
smart fortwo electric drive cabrio  14825.0      NaN      NaN      NaN

                                                    Price                \
Year                                   2022          2018          2019
Name
Acura ILX                               NaN  23990.000000           NaN
Acura MDX                               NaN  27990.000000  31590.000000
Acura MDX Sport Hybrid                  NaN           NaN  42990.000000
Acura RDX                               NaN           NaN  34542.200000
Alfa Romeo Giulia                       NaN  29990.000000  30690.000000
...                                     ...           ...           ...
Volkswagen Passat                       NaN  20554.705882  23190.000000
Volkswagen Tiguan                   23096.0  21377.500000  24660.588235
Volkswagen Tiguan Limited               NaN  19590.000000           NaN
smart fortwo electric drive             NaN  16940.000000           NaN
smart fortwo electric drive cabrio      NaN  18590.000000           NaN


Year                                        2020          2021     2022
Name
Acura ILX                                    NaN           NaN      NaN
Acura MDX                                    NaN           NaN      NaN
Acura MDX Sport Hybrid                       NaN           NaN      NaN
Acura RDX                           37590.000000  43856.666667      NaN
Alfa Romeo Giulia                            NaN           NaN      NaN
...                                          ...           ...      ...
Volkswagen Passat                   25590.000000  25290.000000      NaN
Volkswagen Tiguan                   24144.818182  26675.714286  29590.0
Volkswagen Tiguan Limited                    NaN           NaN      NaN
smart fortwo electric drive                  NaN           NaN      NaN
smart fortwo electric drive cabrio           NaN           NaN      NaN

[231 rows x 10 columns]

### `Question-3:`

You are given a dataset of **Daily Power Generation in India** of regional wise of all Power Stations. Link of the dataset: https://tinyurl.com/2nq6kugt

Task
- In this dataset, there are many columns. Two of them are `Actual(MU)` and `Excess(+) / Shortfall (-)`. `Actual(MU)` represents the actual power generation. `Excess(+) / Shortfall (-)` tells is that generated power is excess or shortfall for that particular day of a power station. You have to find out what should be the actual power generation required for that day by the power stations that there would not be any excess or shorfall power. For the result, make a new column.
- Find out the month of the day and store it as a new column.
- Find out top 10 frequently appeared power stations in this dataframe.
- Next create a pivot table of which every row represents a power station and every column represents a month in a order. Like January, February, March...
- It is hard to get inside if you look through the only pivot table. So plot the pivot table.

In [ ]:
# code here

###`Q-4` You are given a file `question-answer.csv`. Your task is to make a dataframe from it with two columns - `question` and `answers`.

* Questions in the file start from `Q<number>`; E.g.  `Q1` denotes question no. `1`
* Answers starts from `Ans<number>`; Eg. `Ans1` denotes answer of question no `1`
* MAke sure you look at columns name carefully

CSV File - "https://drive.google.com/file/d/10rmV3XrVtzpDTtYZF3UtCdcU0ajBJjGY/view?usp=share_link"

In [ ]:
# code here

###`Q-5`: Print Question and answer of those questions which does not contains any question mark (`?`).

In [ ]:
# code here

###`Q 6-10` LOG and EMPLOYEE
6. Show `activity` details month wise. Show count for each `activity`
7. Find employee who did most `activity` in January month.
8. Employee who have worked most no of times on Weekends.
9. Which activity is logged most on buisness days.
10. Week Days wise activity table.
```
log_file = pd.read_csv("https://docs.google.com/spreadsheets/d/e/2PACX-1vT-OMrmmNdOTM-B5f5F1EpCutMVG230UZiLvqlsg0NIKUKR3yrqiI2r1pEX-LvSEk-3WwySPYtvbBC-/pub?gid=1937029224&single=true&output=csv")
employee = pd.read_csv("https://docs.google.com/spreadsheets/d/e/2PACX-1vQ5AuFqRjSZVBKm5zyDxquX6utubq1DJKkYDI70vjeidAnyAu70KMSYpMYzeVSNVTeUIJBpfF6jU5E6/pub?gid=798824749&single=true&output=csv")

```

Note(for common field):- Employee file has `EMPLOYEE_ID` and LOG file has `emp_id`

In [ ]:
# code here

### `Q-11`:

1. There are missing value in first name of employee. Fill it using email and last name field.

> E.g- `email` -> JMURMAN and `last_name` -> 'Urman' -> so make it's first name as 'JM', Sort of (Email- lastname).

> Email is constructed from initials of first name concate with lastname. Your Task is to fill first name initials in missing data.

2. You can see email field don't have any domain name. Change this to full email addreess with domain as 'campusx.com'.
E.g- Email field -> `JMURMAN`  result -> `JMURMAN@CAMPUSX.COM`

3. Show Full Name of all the employees whose name starts with 'A' and has done any of these activity ['Incpection', 'Cleaning', 'Checking]

In [ ]:
# code here